package com.example.fw;

public class NamesGeneratorHelper extends HelperBase {

	public NamesGeneratorHelper(ApplicationManager manager) {
		super(manager);
	}

	public String[] maleFirstNames() {
		String[] maleFirstNames = null;
		maleFirstNames = new String[] {
			"Сергей",	"Иван",	"Петр",	"Олег",	"Авксентий",	"Агафон",	"Александр",	"Алексей",	"Алик",	"Альберт",	"Альвиан",	"Анатолий",	"Андрей",	"Анисим",	"Антон",	"Антонин",	"Аристарх",	
			"Аркадий",	"Арсен",	"Арсений",	"Артём",	"Борис",	"Вадим",	"Валентин",	"Валерий",	"Валерьян",	"Варлам",	"Василий",	"Виктор",	"Виталий",	"Владимир",	"Владислав",	"Вячеслав",	
			"Геласий",	"Геннадий",	"Георгий",	"Герман",	"Германн",	"Глеб",	"Гордей",	"Григорий",	"Даниил",	"Демьян",	"Денис",	"Дмитрий",	"Донат",	"Евгений",	"Евсей",	"Егор",	"Еремей",	
			"Ефим",	"Игнатий",	"Игорь",	"Илья",	"Ириней",	"Кондрат",	"Константин",	"Куприян",	"Лаврентий",	"Леонид",	"Лука",	"Лукий",	"Лукьян",	"Люциан",	"Люций",	"Макар", "Максим",	
			"Мартын",	"Матвей",	"Михаил",	"Мэлор",	"Никита",	"Никола",	"Николай",	"Онисим",	"Пантелеймон",	"Парфений",	"Протасий",	"Роман",	"Семён",	"Серапион",	"Созон",	"Станислав",	
			"Степан",	"Улеб",	"Фёдор",	"Федосей",	"Федот",	"Филат",	"Фома",	"Фрол",	"Христофор",	"Эдуард",	"Юлиан",	"Юрий",	"Яков",	"Якун",	"Ярослав", "" , null, "" , null, "" , null
		};
		return maleFirstNames;
	}
	
	public String[] femaleFirstNames() {
		String[] femaleFirstNames = null;
		femaleFirstNames = new String[] {
			"Анна",	"Агата",	"Агафья",	"Акулина",	"Алевтина",	"Александра",	"Алёна",	"Алина",	"Алла",	"Анастасия",	"Ангелина",	"Анжела",	"Анжелика",	"Антонида",	"Антонина",	"Анфиса",	
			"Арина",	"Валентина",	"Валерия",	"Варвара",	"Василиса",	"Вера",	"Вероника",	"Виктория",	"Галина",	"Гелена",	"Глафира",	"Дарина",	"Дарья",	"Дарьяна",	"Евгения",	"Евдокия",	
			"Евпраксия",	"Евфросиния",	"Екатерина",	"Елена",	"Елизавета",	"Жанна",	"Зинаида",	"Зоя",	"Ивана",	"Ираида",	"Ирина",	"Ия",	"Катерина",	"Кира",	"Клавдия",	"Ксения",	
			"Лада",	"Лариса",	"Лидия",	"Лора",	"Лукия",	"Любовь",	"Людмила",	"Люция",	"Майя",	"Маргарита",	"Марина",	"Мария",	"Марфа",	"Милица",	"Надежда",	"Наина",	"Наталья",	
			"Нина",	"Нинель",	"Нонна",	"Оксана",	"Октябрина",	"Олимпиада",	"Ольга",	"Пелагея",	"Прасковья",	"Раиса",	"Регина",	"Римма",	"Светлана",	"София",	"Таисия",	"Тамара",
			"Татьяна",	"Ульяна",	"Фаина",	"Феврония",	"Фёкла",	"Элеонора",	"Эмилия",	"Юлиана",	"Юлия", "" , null, "" , null, "" , null
		};
		return femaleFirstNames;
	}
	
	public String[] maleLastNames() {
		String[] maleLastNames = null;
		maleLastNames = new String[] {
			"Смирнов",	"Лебедев",	"Волков",	"Семенов",	"Федоров",	"Комаров",	"Ковалев",	"Кудрявцев",	"Яковлев",	"Борисов",	"Лазарев",	"Рябов",	"Фролов",	"Сидоров",	"Егоров",	"Анисимов",	
			"Веселов",	"Миронов",	"Казаков",	"Давыдов",	"Карпов",	"Тихонов",	"Горбунов",	"Савельев",	"Воронов",	"Емельянов",	"Панфилов",	"Лобанов",	"Хохлов",	"Ермаков",	"Сафонов",	"Кошелев",	
			"Исаев",	"Юдин",	"Харитонов",	"Зимин",	"Крюков",	"Владимиров",	"Кононов",	"Фадеев",	"Шаров",	"Брагин",	"Бирюков",	"Одинцов",	"Самойлов",	"Бобылев",	"Мясников", "Хомицкий"
			, "" , null, "" , null, "" , null
		};
		return maleLastNames;
	}

	public String[] femaleLastNames() {
		String[] femaleLastNames = null;
		femaleLastNames = new String[] {
			"Смирнова",	"Лебедева",	"Волкова",	"Семенова",	"Федорова",	"Комарова",	"Ковалева",	"Кудрявцева",	"Яковлева",	"Борисова",	"Лазарева",	"Рябова",	"Фролова",	"Сидорова",	"Егорова",	"Анисимова",	
			"Веселова",	"Миронова",	"Казакова",	"Давыдова",	"Карпова",	"Тихонова",	"Горбунова",	"Савельева",	"Воронова",	"Емельянова",	"Панфилова",	"Лобанова",	"Хохлова",	"Ермакова",	"Сафонова",	
			"Кошелева",	"Исаева",	"Юдина",	"Харитонова",	"Зимина",	"Крюкова",	"Владимирова",	"Кононова",	"Фадеева",	"Шарова",	"Брагина",	"Бирюкова",	"Одинцова",	"Самойлова", "Бобылева", "Мясникова"
			, "" , null, "" , null, "" , null

		};
		return femaleLastNames;
	}

	public String[] uniLastNames() {
		String[] uniSurnames = null;
		uniSurnames = new String[] {
			"Кравченко",	"Череззабороногузадерищенко",	"Романейко",	"Швыдко",	"Гришко",	"Абраменко",	"Абрамчук",	"Адамюк",	"Акименко",	"Андрющенко",	"Анищенко",
			"Буренко",	"Бурлаченко",	"Бурлачук",	"Бурлюк",	"Буряк",	"Бутейко",	"Бутенко",	"Вакарчук",	"Вакуленко",	"Веприк",	"Вергун",	"Веремеенко",	"Гордейчук",	"Горелик",	"Горенко",	
			"Демиденко",	"Демьяненко",	"Демьянюк",	"Денисенко",	"Дмитрук",	"Добош",	"Добрик",	"Добрянски",	"Довгань",	"Дубенко",	"Ерошенко",	"Есауленко", "Есипенко", "Ефименко", "Жежеленко",
			"Железняк",	"Жинкин",	"Жмурко",	"Загайкевич",	"Загороднюк",	"Загорулько",	"Зайчук",	"Закорко",	"Зализняк",	"Запорожан", "Запорожченко", "Захарчук", "Зварич",	"Зеленко",	"Земляк",	
			"Ищенко",	"Кавун",	"Казаченко",	"Калениченко",	"Калетник",	"Калиниченко",	"Кешель",	"Лазаренко",	"Макаренко",	"Мищенко",	"Нестеренко",	"Остроушко",	"Палажченко",	"Приходько",	
			"Родионенко",	"Савенко",	"Сидоренко",	"Табачник",	"Труш",	"Усик",	"Устименко",	"Фисенко",	"Фоменко",	"Хомич",	"Цыганенко",	"Цымбалюк",	"Чубай",	"Чубенко",	"Шимко",	
			"Шинкаренко",	"Юрченко",	"Ярмоленко",	"Яровенко", "" , null, "" , null, "" , null
		};
		return uniSurnames;
	}
	
}
